# DATA CLEANING Assignment 11

# df = pd.DataFrame
({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [494]:
#Create a DataFrame with the given Data
import pandas as pd
import numpy as np
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [495]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

# 1. Some values in the the FlightNumber column are missing. These numbers are meantto increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [496]:
#Filling NaNs(missing data) in FlightNumber column with a series which increases by 10
df['FlightNumber'].interpolate(inplace=True)
#Converting 'FlightNumber' Column to int
df[['FlightNumber']]=df[['FlightNumber']].astype('int64')
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

# 2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values.Assign the correct column names to this temporary DataFrame.

In [497]:
#The From_To column split to separate columns with underscore delimiter. Assigned to a new temporary DataFrame with the split values.
dfTemp=pd.DataFrame(df['From_To'].str.split('_').tolist(),columns=['From','To'])
dfTemp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# 3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [498]:
#Standardise the strings so that only the first letter is uppercase.
dfTemp.apply(lambda x:x.str.capitalize())

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# 4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [499]:
#Delete the From_To column from df and attach the temporary DataFrame
del(df['From_To'])
pd.concat([df,dfTemp],axis=1)

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    LoNDon      paris
1    <Air France> (12)         10055            []    MAdrid      miLAN
2  (British Airways. )         10065  [24, 43, 87]    londON  StockhOlm
3       12. Air France         10075          [13]  Budapest      PaRis
4          "Swiss Air"         10085      [67, 32]  Brussels     londOn

# 5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

In [500]:
#Splitting 'RecentDelays' column which has list of values. Three new columns are created with names delay_0,delay_1....
#Creating a temp DataFrame and assigning the new columns
delays=pd.DataFrame(df['RecentDelays'].tolist())
delays.rename(columns=lambda x: str('delay_'+str(x)),inplace=True)
delays

   delay_0  delay_1  delay_2
0     23.0     47.0      NaN
1      NaN      NaN      NaN
2     24.0     43.0     87.0
3     13.0      NaN      NaN
4     67.0     32.0      NaN

# 6. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays.

In [501]:
#Renaming the First DataFrame df 'RecentDelays' Column to 'delays'
df.rename(columns={'RecentDelays':'delays'},inplace=True)
df

               Airline  FlightNumber        delays
0               KLM(!)         10045      [23, 47]
1    <Air France> (12)         10055            []
2  (British Airways. )         10065  [24, 43, 87]
3       12. Air France         10075          [13]
4          "Swiss Air"         10085      [67, 32]